/**/
"Cancel" = "إلغاء";
/**/
"Delete" = "حذف";
/**/
"Open" = "فتح";
/**/
"Edit" = "تحرير";
/**/
"Yes" = "نعم";

/*Geometry Edit Action Name*/
"Apply Geometry" = "تطبيق الشكل الهندسي";
/*Geometry Edit Action Name*/
"Clear Geometry" = "مسح الشكل الهندسي";
/*Geometry Edit Action Name*/
"Delete Vertex" = "حذف النقطة القممية";
/*Geometry Edit Action Name*/
"Insert Part" = "إدراج جزء";
/*Geometry Edit Action Name*/
"Insert Vertex" = "إدارج نقطة قممية";
/*Geometry Edit Action Name*/
"Move Vertex" = "تحريك النقطة القممية";
/*Geometry Edit Action Name*/
"Remove Part" = "إزالة جزء";

/*Collecting attachments*/
"Add" = "إضافة";
/*Collecting attachments*/
"Take Photo or Video" = "التقاط صورة أو فيديو";
/*Collecting attachments*/
"Choose From Library" = "اختيار من المكتبة";
/*Collecting attachments*/
"Photo" = "صورة";
/*Collecting attachments*/
"Video" = "فيديو";
/*Collecting attachments*/
"Save To Photo Library" = "حفظ في مكتبة الصور";
/*Collecting attachments*/
"Download" = "تحميل";

/*Date attribute*/
"Today" = "اليوم";

/**/
"Attachments" = "المرفقات";
"Attributes" = "السمات";

/**/
"Open in Safari" = "فتح في Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "أدخل رقمًا بين %i و %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %f and %f." = "أدخل رقمًا بين %f و%f.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "عدد الحروف كبير جدًا (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "الرقم يقع خارج النطاق المقبول.";

/* BLOB, RASTER, etc */
"Field type not supported" = "نوع الحقل غير مدعوم.";

/**/
"%d of %d" = "%d من %d";

/**/
"Changing Feature Type" = "يتم الآن تغيير نوع الميزة";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "أنت تقوم الآن بتغيير نوع الميزة، والتي من المحتمل أن تؤدي للكتابة فوق قيم الحقل. هل ترغب بالفعل في القيام بذلك؟";

/**/
"Data for pie chart is invalid" = "بيانات المخطط الدائري غير صحيحة";
"No data to create a pie chart" = "لا توجد بيانات لإنشاء مخطط دائري";

/**/
"Created by %@ seconds ago" = "تم الإنشاء بواسطة %@ منذ ثوان";

/**/
"Created by %@ a minute ago" = "تم الإنشاء بواسطة %@ منذ دقيقة";

/**/
"Edited by %@ seconds ago" = "تم التحرير بواسطة %@ منذ ثوان";

/**/
"Edited by %@ a minute ago" = "تم التحرير بواسطة %@ منذ دقيقة";

/**/
"Created seconds ago" = "تم الإنشاء منذ ثوانٍ";

/**/
"Created a minute ago" = "تم الإنشاء منذ دقيقة";

/**/
"Edited seconds ago" = "تم التحرير منذ ثوانٍ";

/**/
"Edited a minute ago" = "تم التحرير منذ دقيقة";

/**/
"Created by %@ %d minutes ago" = "تم الإنشاء بواسطة %@ منذ %d دقيقة (دقائق)";

/**/
"Created by %@ an hour ago" = "تم الإنشاء بواسطة %@ منذ ساعة";

/**/
"Created by %@ %d hours ago" = "تم الإنشاء بواسطة %@ منذ %d ساعة (ساعات)";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "تم الإنشاء بواسطة %@ يوم %@ في %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "تم الإنشاء بواسطة %@ يوم %@ في %@";

/**/
"Edited by %@ %d minutes ago" = "تم التحرير بواسطة %@ منذ %d دقيقة (دقائق)";

/**/
"Edited by %@ an hour ago" = "تم التحرير بواسطة %@ منذ دقيقة";

/**/
"Edited by %@ %d hours ago" = "تم التحرير بواسطة %@ منذ %d ساعة (ساعات)";

/**/
"Edited by %@ on %@ at %@ - day" = "تم التحرير بواسطة %@ يوم %@ في %@";

/**/
"Edited by %@ on %@ at %@ - full" = "تم التحرير بواسطة %@ يوم %@ في %@";

/**/
"Created by %@" = "تم الإنشاء بواسطة %@";

/**/
"Edited by %@" = "تم التحرير بواسطة %@";

/**/
"Created %d minutes ago" = "تم الإنشاء منذ %d دقيقة (دقائق)";

/**/
"Created an hour ago" = "تم الإنشاء منذ ساعة";

/**/
"Created %d hours ago" = "تم الإنشاء منذ %d ساعة (ساعات)";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "تم الإنشاء يوم %@ في %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "تم الإنشاء يوم %@ في %@";

/**/
"Edited %d minutes ago" = "تم التحرير منذ %d دقيقة (دقائق)";

/**/
"Edited an hour ago" = "تم التحرير منذ ساعة";

/**/
"Edited %d hours ago" = "تم التحرير منذ %d ساعة (ساعات)";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "تم التحرير يوم %@ في %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "تم التحرير يوم %@ في %@";

/* Used to denote a required field */
"Required" = "مطلوب";

/* Used for naming layers with no names */
"Layer %d" = "الطبقة %d";